In [2]:
import numpy as np
import pandas as pd

In [3]:
# DataFrame
# List로 DataFrame 만들기
df = pd.DataFrame([
    [10, 20, 30],
    [40, 50, 60],
    [70, 80, 90]
])

df

    0   1   2
0  10  20  30
1  40  50  60
2  70  80  90

In [7]:
# 열 기준으로 추출하기
df.loc[:, 0]

0    10
1    40
2    70
Name: 0, dtype: int64

In [8]:
# 행 기준으로 추출하기
df.loc[0, :]

0    10
1    20
2    30
Name: 0, dtype: int64

In [9]:
df.loc[:, 0:1]

    0   1
0  10  20
1  40  50
2  70  80

In [10]:
df.loc[:, range(0,2)]

    0   1
0  10  20
1  40  50
2  70  80

In [11]:
df.loc[0:1, :]

    0   1   2
0  10  20  30
1  40  50  60

# Dictionary로 DataFrame 만들기

In [12]:
tbl = pd.DataFrame({
    "weight" : [80.0, 70.4, 65.5, 45.9, 51.2],
    "height" : [170, 180, 155, 143, 154],
    "type" : ['f','n','n','t','t']
})

tbl

   weight  height type
0    80.0     170    f
1    70.4     180    n
2    65.5     155    n
3    45.9     143    t
4    51.2     154    t

In [13]:
# 몸무게 컬럼만 출력하기
tbl.loc[:, 'weight']

0    80.0
1    70.4
2    65.5
3    45.9
4    51.2
Name: weight, dtype: float64

In [14]:
tbl.loc[:, ['weight', 'height']]

   weight  height
0    80.0     170
1    70.4     180
2    65.5     155
3    45.9     143
4    51.2     154

In [18]:
# height 기준으로 오름, 내림차순

In [20]:
tbl.sort_values(by = 'height', ascending=True) # or False : 내림차순

   weight  height type
3    45.9     143    t
4    51.2     154    t
2    65.5     155    n
0    80.0     170    f
1    70.4     180    n